x = input("Рядок який потрібно розібрати: ")
print(x)

#  a. виведіть третій символ цього рядка.
print("Третій символ -", x[2])

# b. виведіть передостанній символ цього рядка.
print("Передостанній символ цього рядка -", x[-2:-1])

#c.виведіть перші п'ять символів цього рядка.
print("Перші п'ять символів цього рядка. -", x[:5])

# d. виведіть весь рядок, крім двох останніх символів.
print("Рядок, крім двох останніх символів -", x[:-2])

# g. виведіть усі символи у зворотному порядку.
print("Yсі символи у зворотному порядку -", x[::-1])


#  i. виведіть довжину цього рядка.
print("Довжина рядка -", len(x))



